Repository: Al-Dos024/Neuro-Rush
Catalog: lib/l10n/intl_*.arb
Languages: ar

# title
source: Welcome aboard
ar: أهلا وسهلا

source: Previous Results
ar: النتائج السابقه

source: Dark Mode
ar: الوضع الداكن

source: About Us
ar: من نحن؟

source: Language
ar: اللغة

source: Log Out
ar: تسجيل الخروج

source: Points
ar: نقطة

# aboutapp
source: About Application
ar: حول التطبيق

# aboutapp_desc
source: It is an application designed to empower individuals and families affected by ADHD, as it combines three main functions: first, diagnosing ADHD. Second, resources on ADHD Topics such as symptoms, types, management strategies, and coping mechanisms can help users better understand themselves and their experiences.
ar: إنه تطبيق مصمم لتمكين الأفراد والأسر المتضررة من اضطراب فرط الحركة ونقص الانتباه، حيث يجمع بين ثلاث وظائف رئيسية: أولاً، تشخيص اضطراب فرط الحركة ونقص الانتباه. ثانياً، يمكن للموارد المتعلقة بموضوعات اضطراب فرط الحركة ونقص الانتباه مثل الأعراض والأنواع واستراتيجيات الإدارة وآليات التأقلم أن تساعد المستخدمين على فهم أنفسهم وتجاربهم بشكل أفضل.

# Whatappdo
source: What does the app do?
ar: ماذا يفعل التطبيق؟

# Whatappdo_desc
source: Third, behavioral therapy tools: The app provides access to evidence-based exercises and techniques to help users manage symptoms, develop life skills, and stimulate and promote positive behaviors
ar: ثالثًا، أدوات العلاج السلوكي: يوفر التطبيق إمكانية الوصول إلى تمارين وتقنيات قائمة على الأدلة لمساعدة المستخدمين على إدارة الأعراض وتطوير المهارات الحياتية وتحفيز السلوكيات الإيجابية وتعزيزها.

# letsstart
source: Let`s get start?
ar: هيا بنا لنبدأ

# Skip_btn
source: Skip
ar: تخطي

# Lets_start_btn
source: Let`s Start?
ar: هيا لنبدا !

# sign_up_title
source: Let`s sign you up.
ar: لنبدأ بتسجيل حسابك

# sign_up_subtitle
source: Be with our family
ar: كن فردا من عائلتنا

source: Name
ar: الاسم

# Enter_name
source: Enter your name
ar: ادخل اسمك

# no_name
source: Please enter name
ar: فصلا ادخل اسمك هنا

source: Age
ar: العمر

# Enter_Age
source: Enter your Age
ar: ادخل عمرك

# no_Age
source: Please enter Age
ar: فضلا ادخل عمرك هنا

source: Email
ar: البريد الالكتروني

# Enter_Email
source: Enter your Email
ar: ادخل بريدك الالكتروني

# no_Email
source: Please enter Email
ar: فضلا ادخل بريدك الالكتروني هنا

source: Password
ar: كلمة المرور

# Enter_Password
source: Enter your Password
ar: ادخل كلمة المرور

# no_Password
source: Please enter Password
ar: فصلا ادخل كلمه المرور هنا

# snackbar_suc
source: Welcome to our family
ar: اهلا بك في العائله !

# snackbar_suc_sub
source: Signing up Successfully !
ar: تم تسجيل حسابك بنجاح !

# snackbar_suc_log
source: Yay!
ar: مرحى !

# snackbar_suc_log_sub
source: Signing in Successfully !
ar: تم تسجيل الدخول بنجاح !

# snackbar_weak
source: Error!
ar: خطأ !

# snackbar_weak_sub
source: Password should be at least 6 characters
ar: كلمة المرور يجب ان لا تقل عن 6 احرف

# snackbar_inv_sub
source: The email address is badly formatted.
ar: البريد الالكتروني غير منسق بشكل جيد

# snackbar_use_sub
source: email already in use
ar: البريد الالكتروني مستعمل

# snackbar_fail_sub
source: No internet connection
ar: لا يوجد اتصال بالانترنت

# snackbar_else_sub
source: An undefined Error happened.
ar: خطأ غير متوقع

# snackbar_used_sub
source: Unexpected error
ar: خطأ غير متوقع

# snackbar_no_sub
source: User not found
ar: المستخدم غير موجود

# snackbar_inv_pass_sub
source: wrong password
ar: كلم’ المرور خاطئه

# snackbar_inv_email_sub
source: Invalid email or pssword
ar: اسم المستخدم او كلمة المرور خاطئه

source: Register
ar: سجل حسابك

# have_account
source: have an account ?
ar: لديك حساب سابق ؟

source: Login now
ar: سجل دخول

# sign_you_title
source: Let`s sign you in
ar: لنبدا بتسجيل دخولك

# sign_you_subtitle
source: Welcome back, You`ve been missed
ar: مرحبا بك مجددا , لقد افتقدناك

source: Forgot Password?
ar: هل نسيت كلمة المرور؟

source: Log in
ar: تسجيل الدخول

# dont_account
source: don`t have an account?
ar: ليست لديك حساب ؟

source: Register now
ar: سجل حسابك

# continue_with
source: or continue with
ar: يمكنك اكمال التسجيل عن طريق

source: What is
ar: ما هو

# What_is_adhd_title
source: What is ADHD?
ar: ما هو ADHD؟

source: Kid Test
ar: اختبار الطفل

source: Adult Test
ar: اختبار البالغ

# Introduction_title
source: Introduction
ar: مقدمة

# Introduction_subtitle
source: ADHD is a common neurodevelopmental disorder that starts in childhood and affects around 5% of the global population. Children with ADHD may struggle to follow instructions, control their actions, and integrate into school environments, leading to academic performance issues. Managing children with ADHD can be challenging for parents and teachers. It`s important to provide children with love, support, and understanding, and to work with healthcare professionals and teachers to learn how to handle the child best.
ar: اضطراب نقص الانتباه وفرط الحركة هو اضطراب شائع في النمو العصبي يبدأ في مرحلة الطفولة ويؤثر على حوالي 5% من سكان العالم. قد يواجه الأطفال المصابون باضطراب نقص الانتباه وفرط الحركة صعوبة في اتباع التعليمات والتحكم في أفعالهم والاندماج في البيئات المدرسية، مما يؤدي إلى مشاكل في الأداء الأكاديمي. قد يكون التعامل مع الأطفال المصابين باضطراب نقص الانتباه وفرط الحركة أمرًا صعبًا بالنسبة للآباء والمعلمين. من المهم توفير الحب والدعم والتفهم للأطفال، والعمل مع المتخصصين في الرعاية الصحية والمعلمين لمعرفة كيفية التعامل مع الطفل بشكل أفضل.

# Symptoms_title
source: Symptoms
ar: الاعراض

# Symptoms_subtitle
source: Attention deficit hyperactivity disorder (ADHD) is characterized by inattention, hyperactivity, and impulsivity. The symptoms are challenging to define. They must be observed for at least six months in two different settings to diagnose ADHD. When the symptoms are categorized in children, three subtypes emerge: predominantly inattention, predominantly hyperactivity-impulsivity, and combined inattention, hyperactivity, and impulsivity. Most people exhibit some of these behaviors, but not to the point where they significantly interfere with their work, relationships, or studies. Symptoms may persist into adulthood, but diagnosing ADHD in adults remains a clinical diagnosis. Symptoms may differ from childhood to adolescence due to adaptations and avoidance mechanisms acquired during socialization.
ar: يتسم اضطراب نقص الانتباه وفرط النشاط بعدم الانتباه وفرط النشاط والاندفاعية. ويصعب تحديد الأعراض. ​​إذ يجب ملاحظتها لمدة ستة أشهر على الأقل في بيئتين مختلفتين لتشخيص اضطراب نقص الانتباه وفرط النشاط. وعند تصنيف الأعراض لدى الأطفال، تظهر ثلاثة أنواع فرعية: عدم الانتباه بشكل أساسي، وفرط النشاط والاندفاعية بشكل أساسي، وعدم الانتباه وفرط النشاط والاندفاعية بشكل مشترك. ويُظهِر معظم الأشخاص بعض هذه السلوكيات، ولكن ليس إلى الحد الذي تتداخل فيه بشكل كبير مع عملهم أو علاقاتهم أو دراستهم. وقد تستمر الأعراض حتى مرحلة البلوغ، ولكن يظل تشخيص اضطراب نقص الانتباه وفرط النشاط لدى البالغين تشخيصًا سريريًا. وقد تختلف الأعراض من الطفولة إلى المراهقة بسبب التكيفات وآليات التجنب المكتسبة أثناء التنشئة الاجتماعية.

# video_desc
source: Video explaining attention deficit
ar: فيديو يوضح اضطراب نقص الانتباه

# video_und
source: hyperactivity disorder
ar: اضطراب فرط النشاط

# Reasons_title
source: Reasons
ar: الأسباب

# Reasons_subtitle
source: There is no single cause for ADHD. However, there are a number of factors that may contribute to or worsen it, including genetics, diet, and physical and social environments.
ar: لا يوجد سبب واحد لاضطراب نقص الانتباه وفرط الحركة. ومع ذلك، هناك عدد من العوامل التي قد تساهم في حدوثه أو تزيد من تفاقمه، بما في ذلك العوامل الوراثية والنظام الغذائي والبيئات المادية والاجتماعية.

# Genetic_factors_title
source: Genetic factors
ar: العوامل الوراثية

# Genetic_factors_subtitle
source: ADHD is thought to be mainly hereditary, with genetic factors contributing to about 75% of cases. Several genes, including those affecting dopamine transporters, are believed to play a role in the disorder. ADHD is considered to be a complex interaction between genetic and environmental factors. One theory suggests that hyperactivity was an adaptive trait in early humans, with individuals with ADHD being more effective at tasks involving risk or competition in certain ancient societies.
ar: يُعتقد أن اضطراب فرط الحركة ونقص الانتباه وراثي في ​​المقام الأول، حيث تساهم العوامل الوراثية في حوالي 75% من الحالات. ويُعتقد أن العديد من الجينات، بما في ذلك تلك التي تؤثر على ناقلات الدوبامين، تلعب دورًا في الاضطراب. ويُعتبر اضطراب فرط الحركة ونقص الانتباه تفاعلًا معقدًا بين العوامل الوراثية والبيئية. وتشير إحدى النظريات إلى أن فرط النشاط كان سمة تكيفية لدى البشر الأوائل، حيث كان الأفراد المصابون باضطراب فرط الحركة ونقص الانتباه أكثر فعالية في المهام التي تنطوي على المخاطرة أو المنافسة في بعض المجتمعات القديمة.

# Environmental_factors_title
source: Environmental factors
ar: العوامل البيئية

# Environmental_factors_subtitle
source: Environmental factors play a significant role in ADHD development. Factors such as alcohol and tobacco exposure during pregnancy, lead exposure, premature birth, and infectious diseases increase the risk. Studies have linked the pesticide chlorpyrifos to ADHD symptoms in children. Higher pesticide exposure correlates with a 35% increased risk of ADHD, and even low levels of exposure can have an impact.
ar: تلعب العوامل البيئية دورًا مهمًا في تطور اضطراب فرط الحركة ونقص الانتباه. وتزيد عوامل مثل التعرض للكحول والتبغ أثناء الحمل، والتعرض للرصاص، والولادة المبكرة، والأمراض المعدية من خطر الإصابة باضطراب فرط الحركة ونقص الانتباه. وقد ربطت الدراسات بين مبيد كلوربيريفوس وأعراض اضطراب فرط الحركة ونقص الانتباه لدى الأطفال. ويرتبط التعرض المرتفع للمبيدات بزيادة خطر الإصابة باضطراب فرط الحركة ونقص الانتباه بنسبة 35%، وحتى التعرض المنخفض للمبيدات قد يكون له تأثير.

# Dietary_systems_title
source: Dietary systems
ar: الأنطمة الغذائية

# Dietary_systems_subtitle
source: A study by the University of Southampton linked children`s consumption of certain artificial colors with hyperactivity, prompting action by the British government and the European Commission. In the United States, federal law requires food manufacturers to disclose the use of artificial colors on product packaging. This allows consumers to make informed choices about the products they purchase. The findings highlight the importance of continued vigilance in regulating artificial colors in food.
ar: وقد ربطت دراسة أجرتها جامعة ساوثهامبتون بين استهلاك الأطفال لبعض الألوان الصناعية وفرط النشاط، مما دفع الحكومة البريطانية والمفوضية الأوروبية إلى اتخاذ إجراءات. وفي الولايات المتحدة، يتطلب القانون الفيدرالي من مصنعي الأغذية الكشف عن استخدام الألوان الصناعية على أغلفة المنتجات. وهذا يسمح للمستهلكين باتخاذ خيارات مستنيرة بشأن المنتجات التي يشترونها. وتسلط النتائج الضوء على أهمية اليقظة المستمرة في تنظيم الألوان الصناعية في الأغذية.

# Pathophysiology_title
source: Pathophysiology
ar: الفسيولوجيا المرضية

# Pathophysiology_subtitle_one
source: The pathophysiology of ADHD is complex and unclear. Research shows reduced brain volume in children with ADHD, particularly in the left prefrontal cortex, suggesting dysfunction in the frontal lobe.
ar: إن الفسيولوجيا المرضية لاضطراب نقص الانتباه وفرط الحركة معقدة وغير واضحة. تشير الأبحاث إلى انخفاض حجم المخ لدى الأطفال المصابين باضطراب نقص الانتباه وفرط الحركة، وخاصة في القشرة الجبهية اليسرى، مما يشير إلى خلل في الفص الجبهي.

# Pathophysiology_subtitle_two
source: Neuroimaging studies are now only used for research purposes, not for diagnosis. A 2005 review identified four interconnected frontal brain regions implicated in ADHD: the lateral prefrontal cortex, the dorsal anterior cingulate cortex, the caudate nucleus, and the cortex.
ar: تُستخدم دراسات التصوير العصبي الآن لأغراض البحث فقط، وليس للتشخيص. حددت دراسة أجريت عام 2005 أربع مناطق مترابطة في الدماغ الأمامي متورطة في اضطراب فرط الحركة ونقص الانتباه: القشرة الجبهية الأمامية الجانبية، والقشرة الحزامية الأمامية الظهرية، والنواة المذنبة، والقشرة.

# enter_data_title
source: Please fill the information
ar: رجاءا اكمل ادخال بيانات طفلك

# enter_data_subtitle
source: this will help us increase the accuracy of the result
ar: سوف يساعدنا على زيادة دقة النتيجة

# enter_gender_title
source: Choose your kid gender :
ar: اختر جنس طفلك :

# enter_age_subtitle
source: Choose your kid age:
ar: اختر عمر طفلك :

source: Boy
ar: ولد

source: Girl
ar: بنت

# go_quiz_btn
source: Go to quiz phase
ar: انتقل الى صفحة الاسالة

source: Back
ar: السابق

source: Next
ar: التالي

source: Quiz for Kid
ar: أسالة عن الطفل

source: Opps
ar: معذرة

# back_btn_massge
source: You can`t get back anymore
ar: لا يمكنك العودة أكثر من ذلك

# next_btn_massge
source: You must select an answer
ar: يجب عليك اختيار اجابة

source: Answer :
ar: الاختيارات :

# Examples_quiz
source: Examples during adulthood:
ar: أمثلة واقعية على السؤال :

# logout
source: Are you sure you want to log out this account ?
ar: هل انت متاكد انك تريد تسجيل الخروج من هذا الحساب ؟

source: Yes
ar: نعم

source: No
ar: لا

source: Opposition
ar: المعارضة

# Opposition_sub
source: It involves breaking rules, problems with those around him.
ar: يتضمن كسر القواعد والمشاكل مع من حوله.

source: Cognitive problems
ar: مشاكل معرفية

# Cognitive_Problems_sub
source: Indicates inattention, problems with organization, difficulty completing tasks
ar: يشير إلى عدم الانتباه ومشاكل في التنظيم وصعوبة في إكمال المهام

source: Hyperactivity
ar: فرط النشاط

# Hyperactivity_sub
source: Inability to sit still for a period of time, feeling of discomfort and agitation
ar: عدم القدرة على الجلوس ساكنًا لفترة من الوقت، والشعور بعدم الراحة والانفعال

source: Anxiety and shyness
ar: القلق والخجل

# Anxiety_and_shyness_sub
source: anxiety and fears, shy, withdrawn.
ar: القلق والمخاوف، الخجل، الانطواء.

source: Perfectionism
ar: الكمال

# Perfectionism_sub
source: Goals higher than their capabilities, obsessive at work, highly sensitive
ar: أهداف أعلى من قدراتهم، مهووسون بالعمل، حساسون للغاية

source: Social problems
ar: المشاكل الاجتماعية

# Social_problems_sub
source: Low self-confidence, low self-esteem, lack of friends
ar: انخفاض الثقة بالنفس، انخفاض تقدير الذات، قلة الأصدقاء

source: Psychosomatic diseases
ar: الأمراض النفسية الجسدية

# Psychosomatic_diseases_sub
source: Pretends to be sick, but he is not.
ar: يتظاهر بأنه مريض، لكنه ليس كذلك.

source: Attention deficit
ar: نقص الانتباه

# Attention_deficit_sub
source: Difficulty in sustaining focus and concentration.
ar: صعوبة في الحفاظ على التركيز.

source: Arousal and impulsivity
ar: الإثارة والاندفاع

# Arousal_and_impulsivity_sub
source: Arousal is heightened activity, impulsivity is acting without thinking.
ar: الإثارة في نشاط متزايد، والاندفاع التصرف دون تفكير.

source: Passion
ar: العواطف

# Passion_sub
source: intense enthusiasm or strong emotion for something.
ar: حماسة شديدة أو عاطفة قوية تجاه شيء ما.

source: General indicator
ar: مؤشر عام

# General_indicator_sub
source: Persistent inattention, hyperactivity, and impulsivity that interferes with daily functioning.
ar: عدم الانتباه المستمر، وفرط النشاط، والاندفاع الذي يتعارض مع الأداء اليومي.

# DMS_5_sub
source: Diagnostic and Statistical Manual of Mental Disorders, 5th Edition
ar: الدليل التشخيصي والإحصائي للاضطرابات العقلية، الطبعة الخامسة

source: Hyperactivity DMS 5
ar: فرط النشاط DMS 5

# Hyperactivity_DMS_5_sub
source: Diagnostic criteria for hyperactivity-impulsivity in the fifth edition.
ar: معايير تشخيص فرط النشاط والاندفاع في الطبعة الخامسة

source: Mixed DMS 5
ar: اجمالي DMS 5

# Mixed_DMS_5_sub
source: Overall diagnostic criteria for ADHD
ar: المعايير التشخيصية الشاملة لاضطراب نقص الانتباه وفرط الحركة

source: More Details
ar: المزيد من المعلومات

# vba
source: Very much below average
ar: أقل من المتوسط ​​بكثير

# sba
source: Significantly below average
ar: أقل من المتوسط ​​بشكل ملحوظ

# ba
source: Below average
ar: أقل من المتوسط

# m
source: Medium
ar: متوسط

# aa
source: Above average
ar: فوق المتوسط

# saa
source: Significantly above average
ar: أعلى من المتوسط ​​بشكل ملحوظ

# vaa
source: Very much above average
ar: أعلى من المتوسط ​​بكثير

source: Ok
ar: حسنا

source: Result of Test
ar: نتائج الفحص

source: Attempt Number
ar: نتيجة المحاولة رقم

source: Average:
ar: متوسط النتائج :

source: Gender/Age:
ar: الجنس / العمر

source: Test Time:
ar: الوقت :

source: Date:
ar: التاريخ :
